app/Controllers/DataAset.php

SELECT *
FROM `data_aset`
---
        public function index() {
            $model = new DataModel();


            $data['data_aset'] = $model ->findAll();