app/Controllers/User.php

    public function ganti_password(){
        $model = new UserModel();
        $validation = [
            'password_lama' => 'required',
            'password_baru' => 'required',
            'konfirmasi_password' => 'required'
        ];
        if (!$this->validate($validation)) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        } else {
            $username = session()->get('username'); // Ambil username dari session
     $passwordLama = $this->request->getPost('password_lama');
        $passwordBaru = $this->request->getPost('password_baru');

            // Ambil data user berdasarkan username
            $user = $model->where('username', $username)->first();
---
SELECT *
FROM `users`
WHERE `username` = 'Multimedia'
 LIMIT 1