app/Models/UserModel.php

SELECT *
FROM `users`
WHERE `username` = 'Admin'
 LIMIT 1
---
    public function getUser($username){
        return $this->where('username', $username)->first();

UPDATE `users` SET `password` = '$2y$10$QKnV/LyAb4X/QiEDIvCMI.2HD1lmXv5h/csXijCibFkrrmRj49/9q'
WHERE `username` = 'Multimedia'
---
    public function updatePassword($username, $newPassword) {
        return $this->db->table('users')
        ->where('username', $username)
        ->update(['password' => $newPassword]);

SELECT *
FROM `users`
WHERE `id` = '15'
 LIMIT 1
---
    public function getById($id){
        return $this->where('id', $id)->first();

SELECT *
FROM `users`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function getPaginatedData($perPage = 10, $keyword = null)
    {
        $builder = $this;

        if ($keyword) {
            $builder ->groupStart()
                     ->like('username', $keyword)
                     ->orLike('unit', $keyword)
                     ->groupEnd();
        }

        return $builder->paginate($perPage);

SELECT *
FROM `users`
WHERE `id` = '8'
 LIMIT 1
---
     public function getUserUnit($user_id)
    {
        $user = $this->where('id', $user_id)->first();

SELECT DISTINCT `unit`
FROM `users`
WHERE `unit` IS NOT NULL
ORDER BY `unit` ASC
---
     public function getAllUnit()
     {
        return $this->select('unit')
        ->distinct()
        ->where('unit IS NOT NULL')
        ->orderBy('unit', 'ASC')
        ->findAll();